In [1]:
import pandas as pd
from scipy.stats import ttest_1samp
import numpy as np

In [18]:
df = pd.read_csv('london_city_2020.csv', skiprows=1)
df

     age    nat   purpose
0     48     UK   Leisure
1     61  Other   Leisure
2     26     UK   Leisure
3     53     UK  Business
4     61  Other  Business
..   ...    ...       ...
995   77  Other   Leisure
996   27     UK  Business
997   18  Other   Leisure
998   21     UK  Business
999   46  Other  Business

[1000 rows x 3 columns]

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   age      1000 non-null   int64
 1   nat      1000 non-null   object
 2   purpose  1000 non-null   object
dtypes: int64(1), object(2)
memory usage: 23.6+ KB

In [20]:
st = {'nat' : 'string'
     ,'purpose' : 'string'}

df = df.astype(st)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   age      1000 non-null   int64
 1   nat      1000 non-null   string
 2   purpose  1000 non-null   string
dtypes: int64(1), string(2)
memory usage: 23.6 KB

In [21]:
#Filter so we only look at UK people going on Leisure holiday
df = df[(df['nat'] == 'UK') & (df['purpose'] == 'Business')]
df

     age nat   purpose
3     53  UK  Business
7     18  UK  Business
26    41  UK  Business
30    66  UK  Business
35    20  UK  Business
..   ...  ..       ...
966   25  UK  Business
976   28  UK  Business
983   48  UK  Business
996   27  UK  Business
998   21  UK  Business

[195 rows x 3 columns]

In [22]:
df.describe()

              age
count  195.000000
mean    43.430769
std     19.874324
min     16.000000
25%     27.000000
50%     42.000000
75%     58.000000
max     87.000000

In [24]:
ttest_1samp(df['age'], 44.5)
#pvalue is not less than 0.05 so no statistically significance change

Ttest_1sampResult(statistic=-0.7512706049299418, pvalue=0.45340018181484776)